/**
 * 存放所有Select的options对象
 * 都放在一起引用单一
 * */

import { Select } from "antd";
import React from "react";

/**
 * 11 PRM 伙伴关系
 * 12 RMS 风险控制
 * 13 BOSS
 * 14 CTS 信贷
 *
 * key 在接口中叫 platform
 * */

export const platformOptions = [
  {
    key: 11,
    value: "PRM",
    name: "客户关系管理"
  },
  {
    key: 12,
    value: "RMS",
    name: "风险控制"
  },
  {
    key: 13,
    value: "BOSS",
    name: "系统设置"
  },
  {
    key: 14,
    value: "CTS",
    name: "信贷交易"
  }
];

//角色列表写死在前端的
export const staffList = [
  {
    key: "BUSINESS_LEADER",
    value: "业务负责人"
  },
  {
    key: "BUSINESS_CHECKER",
    value: "业务复核"
  },
  {
    key: "RISK_LEADER",
    value: "风控负责人"
  },
  {
    key: "RISK_CHECKER",
    value: "风控复核"
  },
  {
    key: "RISK_LEGAL",
    value: "法务"
  },
  {
    key: "RISK_DIRECTOR",
    value: "风控总监"
  },
  {
    key: "GENERAL_MANAGER",
    value: "总经理"
  }
];

//企业状态
export const getBusinessStatus = [
  {
    key: 0,
    value: "全部"
  },
  {
    key: 1,
    value: "草稿"
  },

];
//行业
export const getIndustry = [
  {
    key: 1,
    value: "test"
  },
];
//客户来源
export const getCustomerSource = [
  {
    key: 1,
    value: "test"
  },

];

//项目类型
export const getProjectType = [
  {
    key: 1,
    value: "test"
  },
];

//客户属性
export const getClientProperty = [
  {
    key: 1,
    value: "test"
  },
];
//是否三证合一
export const getIntegration = [
  {
    key: 1,
    value: "是"
  },
  {
    key: 2,
    value: "否"
  }
];
//账号类型
export const getAccountType = [
  {
    key: 1,
    value: "集团"
  },
  {
    key: 2,
    value: "企业"
  }
];

//证件类型
export const getCorporationIdCardType = [
  {
    key: 1,
    value: "身份证"
  },
];

/************************************/

//我的工具-工具类型
export const getMyToolStatus = [
  { key: 1, value: "初始化" },
  { key: 2, value: "草稿" },
  { key: 3, value: "待部署" },
  { key: 4, value: "部署驳回" },
  { key: 5, value: "待审核" },
  { key: 6, value: "审核驳回" },
  { key: 7, value: "审核通过" },
  { key: 8, value: "已上架" },
  { key: 9, value: "已下架" },
  { key: 10, value: "已失效" }
];


//我的工具-部署测试
export const getDeployTestStatus = [
  { key: 3, value: "待部署" },
  { key: 6, value: "审核驳回" },
];

//我的工具-工具类型
export const getExamineToolStatus = [
  { key: 5, value: "待审核" },
  { key: 7, value: "审核通过" },
  { key: 8, value: "已上架" },
  { key: 9, value: "已下架" }
];
//我的工具-工具类型
export const getAuthorityToolStatus = [
  { key: 1, value: "公开" },
  { key: 2, value: "非公开" }
];

//MIS-错误码
export const codeMark =
  {
    "000001":"系统异常",
    "000002":"参数错误",
    "900102":"用户无权限",
    "160101":"原密码不正确",
    "160102":	"密码错误",
    "160103":"用户名已存在",
    "160104":"手机号已存在",
    "160105":"邮箱已经存在",
    "160106":"用户不存在该权限",
    "160107":"用户不存在",
    "160201":"角色不存在",
    "160202":"角色已被删除",
    "160204":"角色名已存在",
    "160301":"工具不存在",
    "160302":"工具状态不为初始化",
    "160303":"工具已被删除",
    "160304":"工具已存在",
    "160401":"工具类型不存在",
    "160402":"工具数量不为零",
    "160403":"工具类型已被删除",
    "160404":"工具类型已存在",
    "160501":"工具版本不存在",
    "160502":"版本号过低",
    "160503":"没有可升级的版本",
    "160504":"该工具版本升级中，请勿重复升级",
    "160505":"富文本信息不存在",
    "160506":"当前状态不允许该操作",
    "160507":"该工具版本未启动审核流程",
    "160508":"工具版本已存在",
    "160509":"校验规则不支持",
    "160510":"该用户没有操作权限",
    "160601":"暂无用户反馈信息",
    "160602":"本条反馈信息已被他人查看",
    "160701":"任务不存在",
    "160702":"任务运行参数数量不匹配",
    "160703":"参数不能为空",
    "160704":"参数格式不正确",
    "160705":"任务执行异常",
    "160801":"工具默认运行环境不存在",
    "160802":"工具默认运行环境已存在",
    "160901":"非法手机号",
    "160902":"验证码输入错误",
    "900202":"密码不正确，请重新输入",
    "900301":"请输入验证码",
    "900302":"验证码不正确，请重新输入",
    "900303":"验证码已失效，请获取验证码",
    "160903":"验证码获取太频繁，请稍后再试",
    "160108":"用户名格式不匹配",
    "160109":"密码格式不匹配",
    "000000":"成功",
    "900101":"用户未登录",
    "161101":"验签失败",
    "161502":"视频主题已上架",
    "161302":"视频数不为0",
    "161303":"视频类型不存在",
    "161304":"视频类型名称超出20字符",
    "161305":"视频类型排序号参数格式不正确",
    "161401":"资源任务编号不存在",
    "161402":"当前用户不可删除该任务",
    "161403":"文件名不能超过x字符",
    "161404":"重命名后文件名超出100字符",
    "161406":"资源子任务编号不存在",
    "161407":"当前资源子任务已是终态",
    "161408":"资源子任务编号不能为空",
    "161409":"通知类型不存在",
    "161410":"xx文件已被其它操作占用",
    "161501":"视频主题名称已存在",
    "161503":"视频主题已下架",
    "161504":"请先上传视频",
    "161505":"视频主题排序号参数格式不正确",
    "161506":"视频主题不存在",
    "161507":"视频主题名称超出50字符",
    "161601":"视频不存在",
    "161602":"未获取到视频时长",
    "161603":"视频名称超出30字符",
    "161604":"视频主题下架才能删除视频",
    "161605":"视频名称重复",
    "161701":"白名单不能为空",
    "161702":"白名单信息不存在",
    "161703":"手机号不能重复",//"手机号已存在"
    "161801":"用户空间数据不存在",
    "161704":"存在重复手机号",
    "161606":"阿里云视频创建失败",
    "160511":"工具版本信息缺失",
    "160514":"文本框小数规则不能与其它规则共用",
    "160205":"角色权限不能为空",
    "160707":"请稍后重试",
    "161009":"文件不存在",
    "161012":"文件夹不存在",
    "161013":"无权限下载",
    "161006":"文件名不能超过100个字符",//？？？？？
    "161008":"文件夹名称不能包含特殊符号",
    "160516":"参数配置信息不全"
  };
//我的工具-校验参数
export const setParamsRules = {
      "uppercase":"大写字母",
      "lowercase":"小写字母",
      "num":"数字",
      "chinese":"中文",
      "decimal":"小数",
      "special":"特殊字符(逗号、冒号、顿号、点、/、 \\、|、_、-)",
  };

// 视频管理-视频状态
export const getVideoStatus = [
  { key: 1, value: "未上架" },
  { key: 2, value: "上架" },
];


